InformationRegisters/ОбменСВнешнимиСистемамиЛогированиеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОбменСВнешнимиСистемамиЛогированиеНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛогированиеВключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьХраненияЗаписейДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаОтключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбменСВнешнимиСистемамиЛогированиеУчетнаяЗапись</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбменСВнешнимиСистемамиЛогирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОбменСВнешнимиСистемамиЛогирование</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбменСВнешнимиСистемамиЛогированиеДействия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоОшибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбменСВнешнимиСистемамиЛогированиеДанныеСсылка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийДлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбменСВнешнимиСистемамиЛогированиеУчетнаяЗапись</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОбменСВнешнимиСистемамиЛогированиеДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ОбменСВнешнимиСистемамиЛогированиеДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаЗаказовИз1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаИзображенийИз1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаОстатковИз1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаТоваровИз1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаЦенИз1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаАтрибутовВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаАтрибутовЗначенияВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаЗаказовВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаИзображенийВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОплатВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОстатковВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаСкладовВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаТоваровВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаЦенВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросАвторизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеТоварногоКаталога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодборТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеЛимитовЗагрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеРекомендации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверкаСтатусаПубликации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварВАрхив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварДобавить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварИзАрхива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварИзменить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварУдалить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбменСВнешнимиСистемамиЛогирование/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает признак логирования.
// 
// Возвращаемое значение:
//  Булево - Логирование включено.
//
Функция ЛогированиеВключено( УчетнаяЗапись = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим( Истина );
	
	Настройки = ЛогированиеНастройкиПолучить( УчетнаяЗапись );
	
	Возврат Настройки.ЛогированиеВключено = Истина;
	
КонецФункции

Функция ЛогированиеНастройкиПолучить( Знач УчетнаяЗапись = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим( Истина );

   	#Область ПроверкаВходящихПараметров
	// УчетнаяЗапись
	ПроверкаЗначение = УчетнаяЗапись;
	ПроверкаОжидаемыеТипы = Метаданные.ОпределяемыеТипы.ОбменСВнешнимиСистемамиЛогированиеУчетнаяЗапись.Тип.Типы();
	ПроверкаОжидаемыеТипы.Добавить( Тип( "Неопределено" ) );
	ПроверитьЗначениеРезультат = ОбменСВнешнимиСистемамиЛогирование.ПроверитьЗначение( ПроверкаЗначение, , ПроверкаОжидаемыеТипы, 
	Ложь, Ложь );
	
	Если ПроверитьЗначениеРезультат = Ложь Тогда
		УчетнаяЗапись = Неопределено;
	КонецЕсли;
	#КонецОбласти
	
	Результат = Новый Структура( "УчетнаяЗапись, ЛогированиеВключено, ДлительностьХраненияЗаписейДней, ПлановаяДатаОтключения", 
	УчетнаяЗапись,
	Ложь, 
	ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ДлительностьХраненияЗаписейДнейПоУмолчанию(),
	ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ПлановаяДатаОтключенияЛогаПоУмолчанию()
	);
	
	ЗапросТекст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбменСВнешнимиСистемамиЛогированиеНастройки.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ОбменСВнешнимиСистемамиЛогированиеНастройки.ЛогированиеВключено КАК ЛогированиеВключено,
	|	ОбменСВнешнимиСистемамиЛогированиеНастройки.ДлительностьХраненияЗаписейДней КАК ДлительностьХраненияЗаписейДней,
	|	ОбменСВнешнимиСистемамиЛогированиеНастройки.ПлановаяДатаОтключения КАК ПлановаяДатаОтключения
	|ИЗ
	|	РегистрСведений.ОбменСВнешнимиСистемамиЛогированиеНастройки КАК ОбменСВнешнимиСистемамиЛогированиеНастройки
	|ГДЕ
	|	ОбменСВнешнимиСистемамиЛогированиеНастройки.УчетнаяЗапись = &УчетнаяЗапись";
	
	Запрос = Новый Запрос( ЗапросТекст );
	Запрос.УстановитьПараметр( "УчетнаяЗапись", УчетнаяЗапись );
	ЗапросРезультат = Запрос.Выполнить();
	
	Если ЗапросРезультат.Пустой() Тогда
		ЛогированиеВключеноЗначениеУстановить( УчетнаяЗапись, Ложь );// удобнее когда есть запись в настройках
		Возврат Результат;
	КонецЕсли;
	
	ЗапросВыборка = ЗапросРезультат.Выбрать();
	ЗапросВыборка.Следующий();
	ЗаполнитьЗначенияСвойств( Результат, ЗапросВыборка );
	
	ДлительностьХраненияЗаписейДнейМаксимальная = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ДлительностьХраненияЗаписейДнейМаксимальная();
	Если Результат.ДлительностьХраненияЗаписейДней > ДлительностьХраненияЗаписейДнейМаксимальная Тогда
		Результат.ДлительностьХраненияЗаписейДней = ДлительностьХраненияЗаписейДнейМаксимальная;
	КонецЕсли;

	ПлановаяДатаОтключенияЛогаМаксимальная = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ПлановаяДатаОтключенияЛогаМаксимальная();
	Если Результат.ПлановаяДатаОтключения > ПлановаяДатаОтключенияЛогаМаксимальная Тогда
		Результат.ПлановаяДатаОтключения = ПлановаяДатаОтключенияЛогаМаксимальная;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

// Включить/выключить логирование
//
// Параметры:
//  УчетнаяЗапись   - ОпределяемыйТип.ОбменСВнешнимиСистемамиЛогированиеУчетнаяЗапись - не обязательный
//  Значение   - Булево - Истина - включить логирование
//  Параметры   - Структура - Дополнительные значения, не обязательный
// 
// Возвращаемое значение:
//  Булево - Установка значения выполнена.
//
Функция ЛогированиеВключеноЗначениеУстановить( УчетнаяЗапись = Неопределено, Значение = Ложь, Параметры = Неопределено ) Экспорт
	
	УстановитьПривилегированныйРежим( Истина );
	
	Менеджер = РегистрыСведений.ОбменСВнешнимиСистемамиЛогированиеНастройки.СоздатьМенеджерЗаписи();
	Менеджер.УчетнаяЗапись = УчетнаяЗапись;
	Менеджер.Прочитать();

	Если Значение = Истина Тогда
		Менеджер.ПлановаяДатаОтключения = Неопределено;
	КонецЕсли;
	
	ЛогНастройкиПроверитьИЗаполнить( Менеджер );
	
	Менеджер.УчетнаяЗапись = УчетнаяЗапись;
	Менеджер.ЛогированиеВключено = Значение;
	
	Менеджер.Записать( Истина );
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат Истина;
КонецФункции

Функция ЛогНастройкиПроверитьИЗаполнить( Настройка ) Экспорт

	ЗначенияИзменены = Ложь;
	
	Если Не ЗначениеЗаполнено( Настройка.ПлановаяДатаОтключения ) Тогда
		Настройка.ПлановаяДатаОтключения = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ПлановаяДатаОтключенияЛогаПоУмолчанию();
		ЗначенияИзменены = Истина;
	Иначе 
		ПлановаяДатаОтключенияЛогаМаксимальная = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ПлановаяДатаОтключенияЛогаМаксимальная();
		Если Настройка.ПлановаяДатаОтключения > ПлановаяДатаОтключенияЛогаМаксимальная Тогда
			Настройка.ПлановаяДатаОтключения = ПлановаяДатаОтключенияЛогаМаксимальная;
			ЗначенияИзменены = Истина;
		КонецЕсли;
	КонецЕсли;

	Если Не ЗначениеЗаполнено( Настройка.ДлительностьХраненияЗаписейДней ) Тогда
		Настройка.ДлительностьХраненияЗаписейДней = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ДлительностьХраненияЗаписейДнейПоУмолчанию();
		ЗначенияИзменены = Истина;
	Иначе
		ДлительностьХраненияЗаписейДнейМаксимальная = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ДлительностьХраненияЗаписейДнейМаксимальная();
		Если Настройка.ДлительностьХраненияЗаписейДней > ДлительностьХраненияЗаписейДнейМаксимальная Тогда
			Настройка.ДлительностьХраненияЗаписейДней = ДлительностьХраненияЗаписейДнейМаксимальная;
			ЗначенияИзменены = Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат ЗначенияИзменены;
КонецФункции

// Записать комментарий в лог
//
// Параметры:
//  Комментарий   - Строка - Комментарий
//  УчетнаяЗапись   - СправочникСсылка.УчетныеЗаписиМаркетплейсов - не обязательный
//  ЭтоОшибка   - Булево - Признак ошибки, не обязательный
//  Параметры   - Структура - Дополнительные значения для записи в лог, не обязательный
// 
// Возвращаемое значение:
//  Булево - Установка значения выполнена.
//
Функция ЗаписатьВЛог( Комментарий, УчетнаяЗапись = Неопределено, ЭтоОшибка = Ложь, Параметры = Неопределено ) Экспорт

	ЗаписатьЕслиВыключен = ПолучитьЗначениеПоля( Параметры, "ЗаписатьЕслиВыключен", Ложь );
	Если ЗаписатьЕслиВыключен = Истина
		Или ОбменСВнешнимиСистемамиЛогированиеПовтИсп.ЛогированиеВключено( УчетнаяЗапись ) = Истина 
		Тогда
		// запишем в лог
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим( Истина );
	
	Если ТранзакцияАктивна() Тогда
		// При отмене транзакции запись регистра сведений отменится, 
		// продублируем сообщение в журнал регистрации
        
        ДанныеСсылка = ПолучитьЗначениеПоля( Параметры, "ДанныеСсылка", Неопределено );
		ЗаписьЖурналаРегистрации( "ОбменСВнешнимиСистемамиЛогирование",
		?( ЭтоОшибка = Истина, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация ),
		,
		ДанныеСсылка,
		Комментарий );

	КонецЕсли;
	
	РС = РегистрыСведений.ОбменСВнешнимиСистемамиЛогирование.СоздатьМенеджерЗаписи();
	
	Если ТипЗнч( Параметры ) = Тип( "Структура" ) Тогда
		ЗаполнитьЗначенияСвойств( РС, Параметры );
	КонецЕсли;
	
	РС.УчетнаяЗапись = УчетнаяЗапись;
	РС.Комментарий = Комментарий;
	РС.КомментарийДлина = СтрДлина( Комментарий );
	РС.ЭтоОшибка = ЭтоОшибка;
	РС.Пользователь = Пользователи.ТекущийПользователь();

	Если Не ЗначениеЗаполнено( РС.ИдентификаторЗаписи ) Тогда
		РС.ИдентификаторЗаписи = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено( РС.Дата ) Тогда
		РС.Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	Если Не ЗначениеЗаполнено( РС.Действие ) Тогда
		РС.Действие = Перечисления.ОбменСВнешнимиСистемамиЛогированиеДействия.Прочее;
	КонецЕсли;

	Если Не ЗначениеЗаполнено( РС.Порядок ) Тогда
		РС.Порядок = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЕсли;
	
	РС.Записать( Ложь );

	УстановитьПривилегированныйРежим( Ложь );
	
	Возврат Истина;
КонецФункции

// Возвращает символ замены недопустимых символов XML для записи в лог
//
// Возвращаемое значение:
//  Строка - символ замены.
//
Функция СимволЗаменыНедопустимыхСимволовXMLПолучить() Экспорт
	Возврат "☼";
КонецФункции

Функция ЗаменитьНедопустимыеСимволыXML( Значение, СимволЗаменыНедопустимыхСимволовXML = Неопределено ) Экспорт
	
	ЗначениеСтрока = Строка( Значение );
	
	Если ПустаяСтрока( ЗначениеСтрока ) Тогда
		Возврат ЗначениеСтрока;
	КонецЕсли;
	
	Если СимволЗаменыНедопустимыхСимволовXML = Неопределено Тогда
		СимволЗаменыНедопустимыхСимволовXML = СимволЗаменыНедопустимыхСимволовXMLПолучить();
	КонецЕсли;
	
	Результат = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML( ЗначениеСтрока, СимволЗаменыНедопустимыхСимволовXML );
	
	Возврат Результат;
КонецФункции

// не вызывает ошибку если поле не существует
// ПараметрПуть - Строка: путь к полю у ПараметрЗначение. Может быть составной через ., например, Поле1.Реквизит2.Атрибут3 
Функция ПолучитьЗначениеПоля( ПараметрЗначение, ПараметрПуть, ЗначениеПоУмолчанию = Неопределено, ТекстОшибки = "" ) Экспорт
	
	Результат = ЗначениеПоУмолчанию;
	
	ЗначениеПолучаемое = ПараметрЗначение;
	ЧастиПути = СтрРазделить( ПараметрПуть, ".", Ложь );
	Попытка
		
		Для Каждого ЧастьПути Из ЧастиПути Цикл
			ЗначениеПолучаемое = ЗначениеПолучаемое[ ЧастьПути ];
		КонецЦикла;
		
		Если ЗначениеПолучаемое = Неопределено Тогда
			Результат = ЗначениеПоУмолчанию;
		Иначе
			Результат = ЗначениеПолучаемое;
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		КраткоеПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки( ИнформацияОбОшибке );
		
		ТекстОшибки = "" + ПараметрПуть + ": <" + ЧастьПути + ">: " + КраткоеПредставлениеОшибки;
		
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

Функция ПроверитьЗначение( ПараметрЗначениеПроверяемое, ПараметрИмяПоляПроверяемое = "", ПараметрТипОжидаемый = Неопределено, 
ПараметрОбязательноеЗаполнение = Истина, ПараметрВызватьИсключение = Истина, ПараметрТекстОшибкиПрефикс = "" ) Экспорт
	
	// ПараметрИмяПоляПроверяемое - путь к полю, может быть составной через ., например, Поле1.Реквизит2.Атрибут3 
	// ПараметрТипОжидаемый: Тип, описание типов или массив. Если Неопределено, то не проверяем тип.
	             

	// проверка корректности переданных параметров в данную функцию
	
	ПроверитьТип = Истина;
	Если ПараметрТипОжидаемый = Неопределено Тогда
		// проверка типа не требуется
		ПроверитьТип = Ложь;
	КонецЕсли;
	
	Если ПроверитьТип = Истина Тогда
	
		ПараметрТипОжидаемыйТип = ТипЗнч( ПараметрТипОжидаемый );
		Если ПараметрТипОжидаемыйТип = Тип( "Тип" ) 
			Или ПараметрТипОжидаемыйТип = Тип( "ОписаниеТипов" ) 
			Или ПараметрТипОжидаемыйТип = Тип( "Массив" ) 
			Тогда
			// тип входящего параметра корректный
		Иначе	
			
			ТекстОшибки = "Функция <ПроверитьЗначение>: Параметр <ПараметрТипОжидаемый>: "
			+ "Ошибка: Передан некорректный тип значения <" + ПараметрТипОжидаемыйТип
			+ ">. Ожидается тип <Тип>, <ОписаниеТипов>, <Массив>.";
			Если Не ПустаяСтрока( ПараметрТекстОшибкиПрефикс ) Тогда
				ТекстОшибки = ПараметрТекстОшибкиПрефикс + ТекстОшибки;
			КонецЕсли;
			
			ЗаписатьВЛог( ТекстОшибки, , Истина );
			
			ОбщегоНазначения.СообщитьПользователю( ТекстОшибки );
			
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
	КонецЕсли;

	ПараметрИмяПоляПроверяемоеТип = ТипЗнч( ПараметрИмяПоляПроверяемое );
	Если ПараметрИмяПоляПроверяемоеТип = Тип( "Строка" ) 
	Или ПараметрИмяПоляПроверяемоеТип = Тип( "Неопределено" ) 
	Тогда
		// тип входящего параметра корректный
	Иначе	
	
		ТекстОшибки = "Функция <ПроверитьЗначение>: Параметр <ПараметрИмяПоляПроверяемое>: Ошибка: Передан некорректный тип значения <" + ПараметрИмяПоляПроверяемоеТип
		+ ">. Ожидается тип <Строка>.";
		Если Не ПустаяСтрока( ПараметрТекстОшибкиПрефикс ) Тогда
			ТекстОшибки = ПараметрТекстОшибкиПрефикс + ТекстОшибки;
		КонецЕсли;
		
		ЗаписатьВЛог( ТекстОшибки, , Истина );
		
		ОбщегоНазначения.СообщитьПользователю( ТекстОшибки );
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	// проверка значений входящих параметров
	
	// рассичтаем ЗначениеПроверяемое
	Если ПустаяСтрока( ПараметрИмяПоляПроверяемое ) Тогда
		ЗначениеПроверяемое = ПараметрЗначениеПроверяемое;
	Иначе
	
		// получим значения поля
		ТестОшибкиДополнение = "";
		ЗначениеПроверяемое = ПолучитьЗначениеПоля( ПараметрЗначениеПроверяемое, ПараметрИмяПоляПроверяемое, , ТестОшибкиДополнение );
		Если СтрДлина( ТестОшибкиДополнение ) > 0 Тогда
			ЕстьОшибка = Истина;
		КонецЕсли;
		
		Если ЕстьОшибка = Истина Тогда
		
			ТекстОшибки = "Ошибка: Некорректное имя поля <" + ПараметрИмяПоляПроверяемое + ">.";
			Если Не ПустаяСтрока( ПараметрТекстОшибкиПрефикс ) Тогда
				ТекстОшибки = ПараметрТекстОшибкиПрефикс + ТекстОшибки;
			КонецЕсли;
			
			Если Не ПустаяСтрока( ТестОшибкиДополнение ) Тогда
				ТекстОшибки = ТекстОшибки + " " + ТестОшибкиДополнение;
			КонецЕсли;

			ЗаписатьВЛог( ТекстОшибки, , Истина );
			
			Если ПараметрВызватьИсключение = Истина Тогда
				ОбщегоНазначения.СообщитьПользователю( ТекстОшибки );
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;

	Если ПроверитьТип = Истина Тогда
		
		ТипыОжидаемые = Новый Массив;
		Если ТипЗнч( ПараметрТипОжидаемый ) = Тип( "Тип" ) Тогда
			ТипыОжидаемые.Добавить( ПараметрТипОжидаемый );
		ИначеЕсли ТипЗнч( ПараметрТипОжидаемый ) = Тип( "ОписаниеТипов" ) Тогда
			ТипыОжидаемые = ПараметрТипОжидаемый.Типы();
		ИначеЕсли ТипЗнч( ПараметрТипОжидаемый ) = Тип( "Массив" ) Тогда
			ТипыОжидаемые = ПараметрТипОжидаемый;
		КонецЕсли;
		
		ТипыОжидаемыеСтрокой = СтрСоединить(ТипыОжидаемые, "," );
		
		ТипПроверяемый = ТипЗнч( ЗначениеПроверяемое );
		Если ТипыОжидаемые.Найти( ТипПроверяемый ) = Неопределено Тогда
			
			ТекстОшибки = "Ошибка: Некорректный тип значения <" + ТипПроверяемый + ">. Ожидаются типы: <" + ТипыОжидаемыеСтрокой + ">.";
			Если Не ПустаяСтрока( ПараметрТекстОшибкиПрефикс ) Тогда
				ТекстОшибки = ПараметрТекстОшибкиПрефикс + ТекстОшибки;
			КонецЕсли;
			
			ЗаписатьВЛог( ТекстОшибки, , Истина );
			
			Если ПараметрВызватьИсключение = Истина Тогда
				ОбщегоНазначения.СообщитьПользователю( ТекстОшибки );
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
			Возврат Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрОбязательноеЗаполнение = Истина Тогда
	
		ТестОшибкиДополнение = "";
		Попытка
        	ЗначениеЗаполнено = ЗначениеЗаполнено( ЗначениеПроверяемое );
        Исключение
        	// Проверка мутабельных значений на заполненность не поддерживается
        	ИнформацияОбОшибке = ИнформацияОбОшибке();
        	КраткоеПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки( ИнформацияОбОшибке );
        	ТестОшибкиДополнение = КраткоеПредставлениеОшибки;
        	ЗначениеЗаполнено = Ложь;
        КонецПопытки;
        
		Если Не ЗначениеЗаполнено Тогда
			
			ТекстОшибки = "Ошибка: Передано пустое значение. Ожидается заполненное.";
			Если Не ПустаяСтрока( ПараметрТекстОшибкиПрефикс ) Тогда
				ТекстОшибки = ПараметрТекстОшибкиПрефикс + ТекстОшибки;
			КонецЕсли;
			
			Если Не ПустаяСтрока( ТестОшибкиДополнение ) Тогда
				ТекстОшибки = ТекстОшибки + " " + ТестОшибкиДополнение;
			КонецЕсли;

			ЗаписатьВЛог( ТекстОшибки, , Истина );
			
			Если ПараметрВызватьИсключение = Истина Тогда
				ОбщегоНазначения.СообщитьПользователю( ТекстОшибки );
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
			Возврат Ложь;
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат Истина;
КонецФункции

// Возвращает строковое представление объекта для записи в лог
//
// Параметры:
//  Объект   - Произвольный - Ссылка или значение
//  Реквизиты - Строка - Имена колонок через "," для добавления в представление объекта, не обязательный
//  Параметры - Структура - Дополнительные параметры, не обязательный
//  ГлубинаРекурсии - Число - Необязательный
// 
// Возвращаемое значение:
//  Строка - Строковое представление объекта.
//
Функция ОбъектПредставление( Объект, Реквизиты = Неопределено, Параметры = Неопределено, ГлубинаРекурсии = 0 ) Экспорт
    
    МаксимальнаяГлубинаРекурсии = 100;
	Если ГлубинаРекурсии >= МаксимальнаяГлубинаРекурсии Тогда
		Возврат НСтр( "ru = '<Ошибка: При получении представления значения превышена глубина рекурсии. Проверьте значение на циклические ссылки.>'" );
	КонецЕсли;
	
	ОбъектТип = ТипЗнч( Объект );
	МассивСтрок = Новый Массив;

	Попытка

		Если ГлубинаРекурсии > 0 Тогда
			КоэффициентОтступа = 2;
			СтрокаДополнениеПоРекурсии = СтрокаСимволамиЗаполнить( " ", ГлубинаРекурсии*КоэффициентОтступа );
		Иначе
			СтрокаДополнениеПоРекурсии = "";
		КонецЕсли;
		
		Если ОбъектТип = Тип( "Неопределено" ) Тогда
			
			Возврат "<Неопределено>";
			
		ИначеЕсли ОбъектТип = Тип( "Null" ) Тогда
			
			Возврат "<NULL>";
			
		ИначеЕсли ОбъектТип = Тип( "Булево" ) Тогда
			
			Возврат ?( Объект = Истина, "<True>", "<False>" );

		ИначеЕсли ОбъектТип = Тип( "HTTPЗапрос" ) Или ОбъектТип = Тип( "HTTPОтвет" ) Тогда
			
			Если ОбъектТип = Тип( "HTTPЗапрос" ) Тогда
				МассивСтрок.Добавить( "Адрес ресурса:" );
				
				ОбъектАдресРесурса = Объект.АдресРесурса;
				// +исключения
				ОбъектАдресРесурса = ЗаменитьИсключенияВСтроке( Объект.АдресРесурса );
				// -исключения
				
				МассивСтрок.Добавить( ОбъектАдресРесурса );
				МассивСтрок.Добавить( "" );
			КонецЕсли;
			
			Если ОбъектТип = Тип( "HTTPОтвет" ) Тогда
				МассивСтрок.Добавить( "Код состояния:" );
				МассивСтрок.Добавить( Объект.КодСостояния );
				МассивСтрок.Добавить( "" );
			КонецЕсли;
			
			ТелоСтроковоеПредставление = ИнтеграцияСМаркетплейсамиСервер.СтруктураСвойствоЗначениеПолучить( Параметры, "ТелоСтроковоеПредставление", "" );
		
			Если ПустаяСтрока( ТелоСтроковоеПредставление ) Тогда
				ТелоСтроковоеПредставление = Объект.ПолучитьТелоКакСтроку();
				Если ТелоСтроковоеПредставление <> Неопределено Тогда
					СимволЗаменыНедопустимыхСимволовXML = СимволЗаменыНедопустимыхСимволовXMLПолучить();
					ТелоСтроковоеПредставление = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(ТелоСтроковоеПредставление, СимволЗаменыНедопустимыхСимволовXML);
				КонецЕсли;
			КонецЕсли;
			
			МассивСтрок.Добавить( "Тело: Строка:" );
			МассивСтрок.Добавить( ТелоСтроковоеПредставление );
			МассивСтрок.Добавить( "" );
			
			МассивСтрок.Добавить( "Заголовки:" );
			Для Каждого Заголовок Из Объект.Заголовки Цикл
				ЗаголовокЗначение = Заголовок.Значение;
				
				// +исключения
				Если Заголовок.Ключ = "Api-Key"
				Или Заголовок.Ключ = "Authorization"
				 Тогда
					ЗаголовокЗначение = "***" + Прав( ЗаголовокЗначение, 2 );// скроем ключ доступа
				КонецЕсли;
				// -исключения
				
				МассивСтрок.Добавить( "" + Заголовок.Ключ + ": " + ЗаголовокЗначение );
			КонецЦикла;
			
		ИначеЕсли ОбъектТип = Тип( "HTTPСоединение" ) Тогда
			
			МассивСтрок.Добавить( "Сервер:" );
			МассивСтрок.Добавить( Объект.Сервер );
			
			МассивСтрок.Добавить( "Защищенное соединение:" );
			МассивСтрок.Добавить( Объект.ЗащищенноеСоединение );
			МассивСтрок.Добавить( "Использовать аутентификацию ОС:" );
			МассивСтрок.Добавить( Объект.ИспользоватьАутентификациюОС );
			МассивСтрок.Добавить( "Пользователь:" );
			МассивСтрок.Добавить( Объект.Пользователь );
			МассивСтрок.Добавить( "Пароль:" );
			МассивСтрок.Добавить( ?(ЗначениеЗаполнено( Объект.Пароль ), "***" + Прав( Объект.Пароль, 2 ), "" ) );
			МассивСтрок.Добавить( "Порт:" );
			МассивСтрок.Добавить( Объект.Порт );
			МассивСтрок.Добавить( "Таймаут:" );
			МассивСтрок.Добавить( Объект.Таймаут );
			
		ИначеЕсли ОбъектТип = Тип( "ТаблицаЗначений" ) Тогда
			ТаблицаЗначений = Объект;

			МассивСтрок.Добавить( "Количество строк: " + ТаблицаЗначений.Количество() );
			
			Если Реквизиты = Неопределено Тогда
				РеквизитыМассив = Новый Массив;
			    Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
			    	РеквизитыМассив.Добавить( Колонка.Имя );
			    КонецЦикла;
			Иначе
				РеквизитыМассив = СтрРазделить( Реквизиты, ", ;", Ложь );
			КонецЕсли;
			
			РеквизитыСтр = "";
			Для Каждого РеквизитИмя Из РеквизитыМассив Цикл
				РеквизитыСтр = РеквизитыСтр + "<" + РеквизитИмя + ">;";
			КонецЦикла;
			МассивСтрок.Добавить( РеквизитыСтр );
			
			НомерПП = 0;
			Для Каждого ТаблицаЗначенийСтрока Из ТаблицаЗначений Цикл
				НомерПП = НомерПП + 1;
				Стр = "";
				Для Каждого РеквизитИмя Из РеквизитыМассив Цикл
					Значение = ТаблицаЗначенийСтрока[ РеквизитИмя ];
					Если Не ЗначениеЗаполнено( Значение ) Тогда
						ЗначениеСтр = НСтр("ru = '<Не заполнено>'");
					Иначе
						ЗначениеСтр = Строка( Значение );
					КонецЕсли;
					Стр = Стр + ЗначениеСтр + ";"
				КонецЦикла;
				МассивСтрок.Добавить( "" + Формат( НомерПП, "ЧГ=0" ) + ". " + Стр );
			КонецЦикла;
			
		ИначеЕсли ОбъектТип = Тип( "Массив" ) Тогда

			Если ГлубинаРекурсии > 0 Тогда
				МассивСтрок.Добавить( "" );
			КонецЕсли;
			
			НомерПП = 0;
			Для Каждого Элемент Из Объект Цикл
				НомерПП = НомерПП + 1;
				
				МассивСтрок.Добавить( СтрокаДополнениеПоРекурсии + Формат( НомерПП, "ЧГ=0" ) + ". "
				+  ОбъектПредставление( Элемент, , , ГлубинаРекурсии + 1 ) + ";" );
			КонецЦикла;
			
		ИначеЕсли ОбъектТип = Тип( "СписокЗначений" ) Тогда

			Если ГлубинаРекурсии > 0 Тогда
				МассивСтрок.Добавить( "" );
			КонецЕсли;
			
			НомерПП = 0;
			Для Каждого Элемент Из Объект Цикл
				НомерПП = НомерПП + 1;
				
				МассивСтрок.Добавить( СтрокаДополнениеПоРекурсии + Формат( НомерПП, "ЧГ=0" ) + ". "
				+ Элемент.Пометка + ": " + Элемент.Представление + ": " + ОбъектПредставление( Элемент.Значение, , , ГлубинаРекурсии + 1 ) + ";" );
			КонецЦикла;

		ИначеЕсли ОбъектТип = Тип( "Структура" )
			Или ОбъектТип = Тип( "Соответствие" )
			Тогда

			Если ГлубинаРекурсии > 0 Тогда
				МассивСтрок.Добавить( "" );
			КонецЕсли;
			
			НомерПП = 0;
			Для Каждого Элемент Из Объект Цикл
				НомерПП = НомерПП + 1;

				МассивСтрок.Добавить( СтрокаДополнениеПоРекурсии + Формат( НомерПП, "ЧГ=0" ) + ". " + Элемент.Ключ + ": "
				+ ОбъектПредставление( Элемент.Значение, , , ГлубинаРекурсии + 1 ) + ";" );
			КонецЦикла;
		ИначеЕсли ОбъектТип = Тип( "КоллекцияЭлементовОтбораКомпоновкиДанных" ) Тогда
			ОтборыКомпоновкиДанныхТолькоАктивные = ИнтеграцияСМаркетплейсамиСервер.СтруктураСвойствоЗначениеПолучить( Параметры, "ОтборыКомпоновкиДанныхТолькоАктивные", Истина );
			ОтборЭлементы = Объект;
			ОтборЭлементыПредставление = ОтборыКомпоновкиДанныхПредставлениеПолучить( ОтборЭлементы, ОтборыКомпоновкиДанныхТолькоАктивные );
			МассивСтрок.Добавить( ОтборЭлементыПредставление );
		Иначе
			
			Попытка
				ОбъектУникальныйИдентификатор = Объект.УникальныйИдентификатор();
			Исключение
				ОбъектУникальныйИдентификатор = "";
			КонецПопытки;
			Дополнение = ?( ЗначениеЗаполнено( ОбъектУникальныйИдентификатор ), ": " + ОбъектУникальныйИдентификатор, "" );
			МассивСтрок.Добавить( Строка( Объект ) + Дополнение );
			
		КонецЕсли;
		
		Стр = СтрСоединить( МассивСтрок, Символы.ПС );
	Исключение
		Стр = НСтр("ru = '<ОбъектПредставление: Ошибка получения представления объекта:'") + " " + ОбъектТип + ">";
	КонецПопытки;
	
	Возврат Стр;
КонецФункции

// Заменяет токен доступа в строки на *** если найден.
//
// Параметры:
//  ПараметрСтрока   - Строка для поиска и замены
//  СтрокаЗамена   - Строка символов для замены в ПараметрСтрока
// 
// Возвращаемое значение:
//  Строка - результат замены.
//
Функция ЗаменитьИсключенияВСтроке( ПараметрСтрока, СтрокаЗамена = "***" ) Экспорт
	СтрокаРезультат = ПараметрСтрока;
	
	КлючПоиска = "&access_token=";
	Позиция = СтрНайти( ПараметрСтрока, КлючПоиска );
	Если Позиция > 0 Тогда
		
		Позиция = Позиция + СтрДлина( КлючПоиска ) - 1;
		СтрокаРезультат = Лев( ПараметрСтрока, Позиция );
		
		Позиция = СтрНайти( ПараметрСтрока, "&", , Позиция );
		СтрокаРезультат = СтрокаРезультат + СтрокаЗамена;
		Если Позиция > 0 Тогда
			СтрокаРезультат = СтрокаРезультат + Сред( ПараметрСтрока, Позиция );
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаРезультат;
КонецФункции

// Возвращает строку для визуального разделения комментария на блоки.
// 
// Возвращаемое значение:
//  Строка - разделитель блоков.
//
Функция КомментарийРазделительБлоков() Экспорт
	Возврат Символы.ПС + Символы.ПС;
КонецФункции

// Возвращает строку с описанием стека вызовов
// 
// Возвращаемое значение:
//  Строка - стек вызовов.
//
Функция СтекВызоваПолучить() Экспорт
	Попытка
		ИскусственноеСозданиеОшибки = 1/0;
	Исключение
		СтекВызоваСтр = ПодробноеПредставлениеОшибки( ИнформацияОбОшибке() );
	КонецПопытки;
	
	ТехническаяПодстрока = "{(1)}:";
	СтекВызоваСтр = СтрЗаменить( СтекВызоваСтр, ТехническаяПодстрока, "" );
	ТехническаяПодстрока = "[ОшибкаВоВремяВыполненияВстроенногоЯзыка, ОшибкаИспользованияВстроенногоЯзыка]";
	СтекВызоваСтр = СтрЗаменить( СтекВызоваСтр, ТехническаяПодстрока, "" );
	
	МассивСтрок = СтрРазделить( СтекВызоваСтр, Символы.ПС, Ложь );

	// удаление первых 3х технических строк
	МассивСтрок.Удалить( 0 );
	МассивСтрок.Удалить( 0 );
	МассивСтрок.Удалить( 0 );
	
	СтекРезультат = СтрСоединить( МассивСтрок, Символы.ПС );
	
 	Возврат СтекРезультат;
КонецФункции

Функция ИнформацияОбОшибкеПричина( ИнформацияОбОшибке ) Экспорт
    
    Причина = "";
	Если ТипЗнч( ИнформацияОбОшибке ) <> Тип("ИнформацияОбОшибке" ) Тогда
		Возврат Причина;
	КонецЕсли;
	
	Причина = ИнформацияОбОшибке.Описание;
	Если ТипЗнч( ИнформацияОбОшибке.Причина ) = Тип( "ИнформацияОбОшибке" ) Тогда
		Причина = Причина + ": " + ИнформацияОбОшибке.Причина.Описание;
	КонецЕсли;
	
	Возврат Причина;
	
КонецФункции

// Удаляет все записи лога по учетной записи. Возвращает Истина в случае успеха.
// 
// Возвращаемое значение:
//  Булево - Истина успешное выполнение.
//
Функция ЛогОчистить( УчетнаяЗапись = Неопределено ) Экспорт
    
    УстановитьПривилегированныйРежим( Истина );
    
   	#Область ПроверкаВходящихПараметров
	// УчетнаяЗапись
	ПроверкаЗначение = УчетнаяЗапись;
	ПроверкаОжидаемыеТипы = Метаданные.ОпределяемыеТипы.ОбменСВнешнимиСистемамиЛогированиеУчетнаяЗапись.Тип.Типы();
	ПроверкаОжидаемыеТипы.Добавить( Тип( "Неопределено" ) );
	ПроверитьЗначениеРезультат = ОбменСВнешнимиСистемамиЛогирование.ПроверитьЗначение( ПроверкаЗначение, , ПроверкаОжидаемыеТипы, 
	Ложь, Истина );
	#КонецОбласти

	Время001 = ТекущаяУниверсальнаяДатаВМиллисекундах();

	НаборЗаписей = РегистрыСведений.ОбменСВнешнимиСистемамиЛогирование.СоздатьНаборЗаписей();
	Если ЗначениеЗаполнено( УчетнаяЗапись ) Тогда
		НаборЗаписей.Отбор.УчетнаяЗапись.Установить( УчетнаяЗапись, Истина );
	КонецЕсли;
	НаборЗаписей.Записать();
	
	Время002 = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ДлительностьСекунд = (Время002 - Время001)/1000;

	Если ЗначениеЗаполнено( УчетнаяЗапись ) Тогда
		ЛогКомментарий = "Удалены все записи лога учетной записи """ + УчетнаяЗапись + """. Длительность " + ДлительностьСекунд + " с.";
	Иначе
		ЛогКомментарий = "Удалены все записи лога ВСЕХ учетных записей. Длительность " + ДлительностьСекунд + " с.";	
	КонецЕсли;
	
	ЛогПараметры = Новый Структура( "ЗаписатьЕслиВыключен", Истина );
	ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ЛогКомментарий, УчетнаяЗапись, , ЛогПараметры );
	
	Возврат Истина;
КонецФункции

Функция ЛогЗаписиСтарыеОчистить( УчетнаяЗапись = Неопределено ) Экспорт
	
	УстановитьПривилегированныйРежим( Истина );
	
	#Область ПроверкаВходящихПараметров
	// УчетнаяЗапись
	ПроверкаЗначение = УчетнаяЗапись;
	ПроверкаОжидаемыеТипы = Метаданные.ОпределяемыеТипы.ОбменСВнешнимиСистемамиЛогированиеУчетнаяЗапись.Тип.Типы();
	ПроверкаОжидаемыеТипы.Добавить( Тип( "Неопределено" ) );
	ПроверитьЗначениеРезультат = ОбменСВнешнимиСистемамиЛогирование.ПроверитьЗначение( ПроверкаЗначение, , ПроверкаОжидаемыеТипы, 
	Ложь, Истина );
	#КонецОбласти
	
	Время001 = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Настройки = ЛогированиеНастройкиПолучить( УчетнаяЗапись );
	
	ДатаСтарыхСообщений = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ДатаДобавитьДни( ТекущаяДатаСеанса(), -Настройки.ДлительностьХраненияЗаписейДней );
	
	// для удаления через набор записей всех строк по учетной записи
	ЗапросТекст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МАКСИМУМ(ОбменСВнешнимиСистемамиЛогирование.Дата) КАК МаксимальнаяДата,
	|	СУММА(1) КАК КоличествоЗаписей
	|ИЗ
	|	РегистрСведений.ОбменСВнешнимиСистемамиЛогирование КАК ОбменСВнешнимиСистемамиЛогирование
	|ГДЕ
	|	ОбменСВнешнимиСистемамиЛогирование.УчетнаяЗапись = &УчетнаяЗапись
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбменСВнешнимиСистемамиЛогирование.УчетнаяЗапись";
	
	Запрос = Новый Запрос( ЗапросТекст );
	Запрос.УстановитьПараметр( "УчетнаяЗапись", УчетнаяЗапись );
	ЗапросРезультат = Запрос.Выполнить();
	Если ЗапросРезультат.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВыполнитьУдалениеВсехЗаписейПоУчетнойЗаписи = Ложь;
	ЗапросВыборка = ЗапросРезультат.Выбрать();
	Если ЗапросВыборка.Следующий() Тогда
		Если ЗапросВыборка.МаксимальнаяДата < ДатаСтарыхСообщений Тогда
			
			ВыполнитьУдалениеВсехЗаписейПоУчетнойЗаписи = Истина;
			КоличествоЗаписейДляУдаления = ЗапросВыборка.КоличествоЗаписей;
			
		КонецЕсли;
	КонецЕсли;
	
	ЛогПараметры = Новый Структура( "ЗаписатьЕслиВыключен", Истина );
	Если ВыполнитьУдалениеВсехЗаписейПоУчетнойЗаписи = Истина Тогда
		// удаление через запись пустого набора записей регистра для оптимизации скорости удаления
		
		ЛогКомментарий = "Начало удаления записей лога через набор записей с датой ранее " + ДатаСтарыхСообщений
		+ ". Количество: " + КоличествоЗаписейДляУдаления;
		
		// запишем в лог после удаления с позицией до начала удаления
		ЛогПараметры.Вставить( "Дата", ТекущаяДатаСеанса() );
		ЛогПараметры.Вставить( "Порядок", ТекущаяУниверсальнаяДатаВМиллисекундах() );

		НаборЗаписей = РегистрыСведений.ОбменСВнешнимиСистемамиЛогирование.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УчетнаяЗапись.Установить( УчетнаяЗапись, Истина );
		НаборЗаписей.Записать( Истина );
        
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ЛогКомментарий, УчетнаяЗапись, , ЛогПараметры );
		ЛогПараметры.Удалить( "Дата" );
		ЛогПараметры.Удалить( "Порядок" );
		
	Иначе
		// удаление по одной записи в цикле

		КоличествоЗаписейВОднойПорции = 100000;
		
		ЗапросТекст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОбменСВнешнимиСистемамиЛогирование.ИдентификаторЗаписи КАК ИдентификаторЗаписи
		|ИЗ
		|	РегистрСведений.ОбменСВнешнимиСистемамиЛогирование КАК ОбменСВнешнимиСистемамиЛогирование
		|ГДЕ
		|	ОбменСВнешнимиСистемамиЛогирование.УчетнаяЗапись = &УчетнаяЗапись
		|	И ОбменСВнешнимиСистемамиЛогирование.Дата < &ДатаСтарыхСообщений
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбменСВнешнимиСистемамиЛогирование.Дата";
		
		ЗапросТекст = СтрЗаменить( ЗапросТекст, "ПЕРВЫЕ 1", "ПЕРВЫЕ " + Формат( КоличествоЗаписейВОднойПорции, "ЧГ=0" ) );
		
		Запрос = Новый Запрос( ЗапросТекст );
		Запрос.УстановитьПараметр( "УчетнаяЗапись", УчетнаяЗапись );
		Запрос.УстановитьПараметр( "ДатаСтарыхСообщений", ДатаСтарыхСообщений );
		ЗапросРезультат = Запрос.Выполнить();
		Если ЗапросРезультат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		
		ЗапросВыборка = ЗапросРезультат.Выбрать();
		
		КоличествоЗаписейДляУдаления = ЗапросВыборка.Количество();
		
		ЛогКомментарий = "Начало удаления записей лога с датой ранее " + ДатаСтарыхСообщений
		+ ". Количество: " + КоличествоЗаписейДляУдаления;
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ЛогКомментарий, УчетнаяЗапись, , ЛогПараметры );
		
		Менеджер = РегистрыСведений.ОбменСВнешнимиСистемамиЛогирование.СоздатьМенеджерЗаписи();
		Пока ЗапросВыборка.Следующий() Цикл
			Менеджер.ИдентификаторЗаписи = ЗапросВыборка.ИдентификаторЗаписи;
			Менеджер.УчетнаяЗапись = УчетнаяЗапись;
			Менеджер.Удалить();
		КонецЦикла;
		
	КонецЕсли;
	
	Время002 = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ДлительностьСекунд = (Время002 - Время001)/1000;
	
	ЛогКомментарий = "Удалены записи лога с датой ранее " + ДатаСтарыхСообщений + ". Количество: "
	+ КоличествоЗаписейДляУдаления + ". Длительность " + ДлительностьСекунд + " с.";
	ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ЛогКомментарий, УчетнаяЗапись, , ЛогПараметры );
	
	Возврат Истина;
КонецФункции

Процедура ЛогОтключитьПоПлановойДатеОтключения( УчетнаяЗапись ) Экспорт
	
	Настройки = ОбменСВнешнимиСистемамиЛогирование.ЛогированиеНастройкиПолучить( УчетнаяЗапись  );
	
	Если Настройки.ПлановаяДатаОтключения > ТекущаяДатаСеанса() Тогда
		Возврат;
	КонецЕсли;
    
    Если Настройки.ЛогированиеВключено = Ложь Тогда
    	Возврат;
    КонецЕсли;
    
	ОбменСВнешнимиСистемамиЛогирование.ЛогированиеВключеноЗначениеУстановить( УчетнаяЗапись, Ложь );
	
КонецПроцедуры

Функция ЛогУчетныеЗаписиДляОчисткиСтарыхЗаписейИОтключенияПолучить()

	УчетныеЗаписиЛогаЗапросТекст = 
	"ВЫБРАТЬ
	|	ОбменСВнешнимиСистемамиЛогирование.УчетнаяЗапись КАК УчетнаяЗапись,
	|	МАКСИМУМ(ОбменСВнешнимиСистемамиЛогирование.Дата) КАК ДатаМаксимальная,
	|	МИНИМУМ(ОбменСВнешнимиСистемамиЛогирование.Дата) КАК ДатаМинимальная,
	|	ЕСТЬNULL(ОбменСВнешнимиСистемамиЛогированиеНастройки.ЛогированиеВключено, ЛОЖЬ) КАК ЛогированиеВключено,
	|	ЕСТЬNULL(ОбменСВнешнимиСистемамиЛогированиеНастройки.ДлительностьХраненияЗаписейДней, &ДлительностьХраненияЗаписейДнейПоУмолчанию) КАК ДлительностьХраненияЗаписейДней,
	|	ЕСТЬNULL(ОбменСВнешнимиСистемамиЛогированиеНастройки.ПлановаяДатаОтключения, &ПлановаяДатаОтключенияПоУмолчанию) КАК ПлановаяДатаОтключения
	|ИЗ
	|	РегистрСведений.ОбменСВнешнимиСистемамиЛогирование КАК ОбменСВнешнимиСистемамиЛогирование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбменСВнешнимиСистемамиЛогированиеНастройки КАК ОбменСВнешнимиСистемамиЛогированиеНастройки
	|		ПО ОбменСВнешнимиСистемамиЛогирование.УчетнаяЗапись = ОбменСВнешнимиСистемамиЛогированиеНастройки.УчетнаяЗапись
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбменСВнешнимиСистемамиЛогирование.УчетнаяЗапись,
	|	ОбменСВнешнимиСистемамиЛогированиеНастройки.ЛогированиеВключено,
	|	ОбменСВнешнимиСистемамиЛогированиеНастройки.ДлительностьХраненияЗаписейДней,
	|	ОбменСВнешнимиСистемамиЛогированиеНастройки.ПлановаяДатаОтключения";
	
	УчетныеЗаписиЛогаЗапрос = Новый Запрос( УчетныеЗаписиЛогаЗапросТекст );
	УчетныеЗаписиЛогаЗапрос.УстановитьПараметр( "ДлительностьХраненияЗаписейДнейПоУмолчанию", ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ДлительностьХраненияЗаписейДнейПоУмолчанию() );
	УчетныеЗаписиЛогаЗапрос.УстановитьПараметр( "ПлановаяДатаОтключенияПоУмолчанию", ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ПлановаяДатаОтключенияЛогаПоУмолчанию() );
	УчетныеЗаписиЛога = УчетныеЗаписиЛогаЗапрос.Выполнить().Выгрузить();
	
	УчетныеЗаписиЛога.Колонки.Добавить( "ОтключитьПоПлановойДате", Новый ОписаниеТипов( "Булево" ) );
	УчетныеЗаписиЛога.Колонки.Добавить( "ОчиститьСтарыеЗаписи", Новый ОписаниеТипов( "Булево" ) );
	
	Дата = ТекущаяДатаСеанса();
	СтрокиДляИсключенияИзРезультата = Новый Массив;
	Для Каждого УчетныеЗаписиЛогаСтрока Из УчетныеЗаписиЛога Цикл
		
		НастройкаЗначенияИзменены = ЛогНастройкиПроверитьИЗаполнить( УчетныеЗаписиЛогаСтрока );
		Если НастройкаЗначенияИзменены = Истина Тогда
			// запишем корректные значения в настройки лога по учетной записи
			ЛогированиеВключеноЗначениеУстановить( УчетныеЗаписиЛогаСтрока.УчетнаяЗапись, УчетныеЗаписиЛогаСтрока.ЛогированиеВключено );
		КонецЕсли;
		
		Если УчетныеЗаписиЛогаСтрока.ПлановаяДатаОтключения < Дата
		И УчетныеЗаписиЛогаСтрока.ЛогированиеВключено = Истина
		Тогда
			УчетныеЗаписиЛогаСтрока.ОтключитьПоПлановойДате = Истина;
		КонецЕсли;

		ДатаСтарыхСообщений = ОбменСВнешнимиСистемамиЛогированиеКлиентСервер.ДатаДобавитьДни( Дата, -УчетныеЗаписиЛогаСтрока.ДлительностьХраненияЗаписейДней );		
		Если УчетныеЗаписиЛогаСтрока.ДатаМинимальная < ДатаСтарыхСообщений Тогда
			УчетныеЗаписиЛогаСтрока.ОчиститьСтарыеЗаписи = Истина;
		КонецЕсли;
		
		Если УчетныеЗаписиЛогаСтрока.ОтключитьПоПлановойДате = Ложь
		И УчетныеЗаписиЛогаСтрока.ОчиститьСтарыеЗаписи = Ложь Тогда
			СтрокиДляИсключенияИзРезультата.Добавить( УчетныеЗаписиЛогаСтрока );
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокиДляИсключенияИзРезультатаСтрока Из СтрокиДляИсключенияИзРезультата Цикл
		УчетныеЗаписиЛога.Удалить( СтрокиДляИсключенияИзРезультатаСтрока );
	КонецЦикла;
	
	Возврат УчетныеЗаписиЛога;
КонецФункции

Функция ЛогСтарыеЗаписиПоВсемУчетнымЗаписямОчиститьИОтключитьПоПлановойДате( УчетныеЗаписиЛога = Неопределено) Экспорт
	
	Результат = Новый Структура( "УчетныеЗаписи", Новый Соответствие );
	
	Если УчетныеЗаписиЛога = Неопределено Тогда
		УчетныеЗаписиЛога = ЛогУчетныеЗаписиДляОчисткиСтарыхЗаписейИОтключенияПолучить();
	КонецЕсли;
		
	Для Каждого УчетныеЗаписиЛогаСтрока Из УчетныеЗаписиЛога Цикл
		
		УчетнаяЗапись = УчетныеЗаписиЛогаСтрока.УчетнаяЗапись;
		
		Если УчетныеЗаписиЛогаСтрока.ОтключитьПоПлановойДате = Истина Тогда
			ЛогОтключитьПоПлановойДатеОтключения( УчетнаяЗапись );
			Результат.УчетныеЗаписи.Вставить( УчетнаяЗапись );
		КонецЕсли;
		
		Если УчетныеЗаписиЛогаСтрока.ОчиститьСтарыеЗаписи = Истина Тогда
			ЛогЗаписиСтарыеОчистить( УчетнаяЗапись );
			Результат.УчетныеЗаписи.Вставить( УчетнаяЗапись );
		КонецЕсли;

	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ЛогЗаписиСтарыеПоВсемУчетнымЗаписямОчиститьЧерезФоновоеЗадание() Экспорт
    
    УстановитьПривилегированныйРежим( Истина );
    
	Ключ = "ЛогСтарыеЗаписиПоВсемУчетнымЗаписямОчиститьИОтключитьПоПлановойДате";
    ИмяМетода = "ОбменСВнешнимиСистемамиЛогирование.ЛогСтарыеЗаписиПоВсемУчетнымЗаписямОчиститьИОтключитьПоПлановойДате";
	Отбор = Новый Структура;
	Отбор.Вставить( "Ключ", Ключ );
	Отбор.Вставить( "ИмяМетода", ИмяМетода );
	Отбор.Вставить( "Состояние", СостояниеФоновогоЗадания.Активно );
	
	АктивныеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания( Отбор );
	Если АктивныеФоновыеЗадания.Количество() > 0 Тогда
		// уже выполняется
		Возврат Ложь;
	КонецЕсли;

    УчетныеЗаписи = ЛогУчетныеЗаписиДляОчисткиСтарыхЗаписейИОтключенияПолучить();
    Если УчетныеЗаписи.Количество() = 0 Тогда
    	// действия не требуются
    	Возврат Ложь;
    КонецЕсли;
	
	Наименование = "Обмен с внешними системами: Логирование: Удаление старых записей и отключение лога по плановой дате";

	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить( УчетныеЗаписи );
	ФоновыеЗадания.Выполнить( ИмяМетода, ПараметрыФункции, Ключ, Наименование );
	
	Возврат Истина;
КонецФункции

// Возвращает фразы и пояснения из макета.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - содержит колонки "КлючевыеФразы", "Расшифровка", Рекомендация.
//
Функция БазаЗнанийПолучить() Экспорт
	Макет = ПолучитьОбщийМакет( "ИнтеграцияССайтамиИМаркетплейсамиОшибкиРасшифровка" );
	Макет.Макет = Ложь;

	БазаЗнаний = Новый ТаблицаЗначений;
	БазаЗнаний.Колонки.Добавить( "КлючевыеФразы" );
	БазаЗнаний.Колонки.Добавить( "Расшифровка" );
	БазаЗнаний.Колонки.Добавить( "Рекомендация" );

	СтрокиКоличество = Макет.ВысотаТаблицы;
	Для СтрокаНомер = 2 По СтрокиКоличество Цикл
		
		КлючевыеФразы = СокрЛП( Макет.Область( СтрокаНомер, 1 ).Текст );
		Если ПустаяСтрока( КлючевыеФразы ) Тогда
			Прервать;
		КонецЕсли;
		
		БазаЗнанийСтрока = БазаЗнаний.Добавить();
		
		КлючевыеФразы = ВРег( КлючевыеФразы );
		БазаЗнанийСтрока.КлючевыеФразы = СтрРазделить( КлючевыеФразы, "#", Ложь );
		БазаЗнанийСтрока.Расшифровка = СокрЛП( Макет.Область( СтрокаНомер, 2 ).Текст );
		Если СтрДлина( БазаЗнанийСтрока.Расшифровка ) > 0 И Прав( БазаЗнанийСтрока.Расшифровка, 1 ) <> "." Тогда
			БазаЗнанийСтрока.Расшифровка = БазаЗнанийСтрока.Расшифровка + ".";
		КонецЕсли;

		БазаЗнанийСтрока.Рекомендация = СокрЛП( Макет.Область( СтрокаНомер, 3 ).Текст );
		Если СтрДлина( БазаЗнанийСтрока.Рекомендация ) > 0 И Прав( БазаЗнанийСтрока.Рекомендация, 1 ) <> "." Тогда
			БазаЗнанийСтрока.Рекомендация = БазаЗнанийСтрока.Рекомендация + ".";
		КонецЕсли;
	КонецЦикла;
	
	Возврат БазаЗнаний;
КонецФункции

Функция БазаЗнанийСовпаденияНайти( Текст, ПараметрыКонтекст = Неопределено ) Экспорт

	Результат = Новый Массив;

	Если ПустаяСтрока( Текст ) Тогда
		Возврат Результат;
	КонецЕсли;

	ТекстМаксимальнаяДлина = 2000;
	ТекстДляПоиска = Врег( Лев( СокрЛ( Текст ), ТекстМаксимальнаяДлина ));
	
	БазаЗнаний = ОбменСВнешнимиСистемамиЛогированиеПовтИсп.БазаЗнанийПолучить();

	Для Каждого БазаЗнанийСтрока Из БазаЗнаний Цикл
		
		СовпадениеНайдено = Истина;
		Для Каждого КлючеваяФраза Из БазаЗнанийСтрока.КлючевыеФразы Цикл
			Если СтрНайти( ТекстДляПоиска, КлючеваяФраза ) = 0 Тогда
				СовпадениеНайдено = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СовпадениеНайдено = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатЭлемент = Новый Структура( "КлючевыеФразы, Расшифровка, Рекомендация" );
		ЗаполнитьЗначенияСвойств( РезультатЭлемент, БазаЗнанийСтрока );
		Результат.Добавить( РезультатЭлемент );
		
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция БазаЗнанийСовпаденияНайтиСтрокойПолучить( Текст, ПараметрыКонтекст = Неопределено ) Экспорт

	РезультатСтрокой = "";
	
	БазаЗнанийСовпадения = БазаЗнанийСовпаденияНайти( Текст, ПараметрыКонтекст);
	БазаЗнанийСовпаденияКоличество = БазаЗнанийСовпадения.Количество();
	Если БазаЗнанийСовпаденияКоличество = 0 Тогда
		Возврат РезультатСтрокой;
	КонецЕсли;
	
	Дополнение = "";
	НомерПП = 0;
	Для Каждого БазаЗнанийСовпаденияЭлемент Из БазаЗнанийСовпадения Цикл
		НомерПП = НомерПП + 1;
		Если БазаЗнанийСовпаденияКоличество > 1 Тогда
			Дополнение = ?(НомерПП > 1, Символы.ПС, "" ) + НомерПП + " -> " + БазаЗнанийСовпаденияКоличество + ") ";
		КонецЕсли;
		РезультатСтрокой = РезультатСтрокой + Дополнение + БазаЗнанийСовпаденияЭлемент.Расшифровка;
		Если Не ПустаяСтрока( БазаЗнанийСовпаденияЭлемент.Рекомендация ) Тогда
			РезультатСтрокой = РезультатСтрокой + " " + БазаЗнанийСовпаденияЭлемент.Рекомендация;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатСтрокой;
КонецФункции

Функция СтрокаСимволамиЗаполнить( Символ, Количество ) Экспорт
	
	Строка = "";
	Для СимволНомер = 1 По Количество Цикл
		Строка = Строка + Символ;
	КонецЦикла;
	
	Возврат Строка;
КонецФункции

Функция ОтборыКомпоновкиДанныхПредставлениеПолучить( ОтборЭлементы, ТолькоАктивные = Истина ) Экспорт

	Если ТипЗнч( ОтборЭлементы ) <> Тип( "КоллекцияЭлементовОтбораКомпоновкиДанных" ) Тогда
		ВызватьИсключение "ОтборыПредставлениеПолучить: Параметр функции передан некорректно. Ожидается тип ""КоллекцияЭлементовОтбораКомпоновкиДанных"".";
	КонецЕсли;
	
	ОтборыПредставление = "";
	Глубина = 1;
	ОтборыКомпоновкиДанныхПредставлениеРекурсивноПолучить( ОтборЭлементы, Глубина, ТолькоАктивные, ОтборыПредставление );
	
	Возврат ОтборыПредставление;
КонецФункции

Функция ЛогВыгрузить( УчетнаяЗапись ) Экспорт
	
   	#Область ПроверкаВходящихПараметров
	// УчетнаяЗапись
	ПроверкаЗначение = УчетнаяЗапись;
	ПроверкаОжидаемыеТипы = Метаданные.ОпределяемыеТипы.ОбменСВнешнимиСистемамиЛогированиеУчетнаяЗапись.Тип.Типы();
	ПроверкаОжидаемыеТипы.Добавить( Тип( "Неопределено" ) );
	ПроверитьЗначениеРезультат = ОбменСВнешнимиСистемамиЛогирование.ПроверитьЗначение( ПроверкаЗначение, , ПроверкаОжидаемыеТипы, 
	Ложь, Истина );
	#КонецОбласти
	
	ЗапросТекст =
	"ВЫБРАТЬ
	|	ОбменСВнешнимиСистемамиЛогирование.Дата КАК Дата,
	|	ОбменСВнешнимиСистемамиЛогирование.ЭтоОшибка КАК ЭтоОшибка,
	|	ОбменСВнешнимиСистемамиЛогирование.Комментарий КАК Комментарий,
	|	ОбменСВнешнимиСистемамиЛогирование.КомментарийДлина КАК КомментарийДлина,
	|	ОбменСВнешнимиСистемамиЛогирование.Действие КАК Действие,
	|	ОбменСВнешнимиСистемамиЛогирование.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ОбменСВнешнимиСистемамиЛогирование.Сервер КАК Сервер,
	|	ОбменСВнешнимиСистемамиЛогирование.АдресРесурса КАК АдресРесурса,
	|	ОбменСВнешнимиСистемамиЛогирование.ДанныеСсылка КАК ДанныеСсылка,
	|	ОбменСВнешнимиСистемамиЛогирование.Пользователь КАК Пользователь,
	|	ОбменСВнешнимиСистемамиЛогирование.Порядок КАК Порядок,
	|	ОбменСВнешнимиСистемамиЛогирование.ИдентификаторЗаписи КАК ИдентификаторЗаписи
	|ИЗ
	|	РегистрСведений.ОбменСВнешнимиСистемамиЛогирование КАК ОбменСВнешнимиСистемамиЛогирование
	|ГДЕ
	|	ОбменСВнешнимиСистемамиЛогирование.УчетнаяЗапись = &УчетнаяЗапись
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок УБЫВ";
	ЗапросОбъект = Новый Запрос( ЗапросТекст );
	ЗапросОбъект.УстановитьПараметр( "УчетнаяЗапись", УчетнаяЗапись );
	Данные = ЗапросОбъект.Выполнить().Выгрузить();
	
	Лог = ИнтеграцияСИнтернетМагазиномСервер.ТаблицаЗначенийВТабличныйДокумент( Данные );
	
	Возврат Лог;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтборыКомпоновкиДанныхПредставлениеРекурсивноПолучить( ОтборЭлементы, Глубина, ТолькоАктивные = Истина, ОтборыПредставление = "" )
    
    МаксимальнаяГлубинаРекурсии = 100;
	Если Глубина > МаксимальнаяГлубинаРекурсии Тогда
		ВызватьИсключение "ОтборыКомпоновкиДанныхПредставлениеРекурсивноПолучить: Превышена максимальная глубина рекурсии " + МаксимальнаяГлубинаРекурсии + ".";
	КонецЕсли;
	
	Отступ = СтрокаСимволамиЗаполнить( " ", (Глубина - 1)*4 );
	
	ТипЭлементОтбораКомпоновкиДанных = Тип( "ЭлементОтбораКомпоновкиДанных" );
	ТипГруппаЭлементовОтбораКомпоновкиДанных = Тип( "ГруппаЭлементовОтбораКомпоновкиДанных" );
	Для Каждого ОтборЭлемент Из ОтборЭлементы Цикл
		
		Если ТолькоАктивные = Истина 
		И ОтборЭлемент.Использование <> Истина Тогда
			Продолжить;
		КонецЕсли;
 		
 		ОтборЭлементТип = ТипЗнч( ОтборЭлемент );
 		ОтборЭлементИспользованиеСтрокой = ?(ОтборЭлемент.Использование = Истина, "+", "-" );
 		
		Если ОтборЭлементТип = ТипЭлементОтбораКомпоновкиДанных Тогда
			ПравоеЗначениеПредставление = ОбменСВнешнимиСистемамиЛогирование.ОбъектПредставление( ОтборЭлемент.ПравоеЗначение );
			ОтборПредставление = "" + ОтборЭлементИспользованиеСтрокой + " <" + ОтборЭлемент.ЛевоеЗначение + "> "
			+ ОтборЭлемент.ВидСравнения + " <" + ПравоеЗначениеПредставление + ">;";
		ИначеЕсли ОтборЭлементТип = ТипГруппаЭлементовОтбораКомпоновкиДанных Тогда
			ОтборПредставление = "" + ОтборЭлементИспользованиеСтрокой + " " + ОтборЭлемент.ТипГруппы;
		Иначе
			ОтборПредставление = "<Ошибка: ОтборыКомпоновкиДанныхПредставлениеРекурсивноПолучить: Тип не обрабатывается: " + ОтборЭлементТип + ">";
			Продолжить;
		КонецЕсли;
		
 		ПереводСтрокиЕслиНужен = ?( ПустаяСтрока( ОтборыПредставление ), "", Символы.ПС );
        ОтборыПредставление = ОтборыПредставление + ПереводСтрокиЕслиНужен + Отступ + ОтборПредставление;
        
        Если ОтборЭлементТип = ТипГруппаЭлементовОтбораКомпоновкиДанных Тогда
			ОтборыКомпоновкиДанныхПредставлениеРекурсивноПолучить( ОтборЭлемент.Элементы, Глубина + 1, ТолькоАктивные, ОтборыПредставление );
		КонецЕсли;
		
	КонецЦикла;
    
    Возврат Истина;
КонецФункции

Функция MimeТипыСодержимого() Экспорт

	Результат = Новый Соответствие;
	
	Результат.Вставить( "json", "application/json" );
	Результат.Вставить( "pdf", "application/pdf" );
	Результат.Вставить( "xhtml", "application/xhtml+xml" );
	Результат.Вставить( "zip", "application/zip" );
	Результат.Вставить( "gzip", "application/gzip" );
	                    
	Результат.Вставить( "aac", "audio/aac" );
	Результат.Вставить( "ogg", "audio/ogg" );
	Результат.Вставить( "wma", "audio/x-ms-wma" );
	Результат.Вставить( "wav", "audio/vnd.wave" );
	
	Результат.Вставить( "gif", "image/gif" );
	Результат.Вставить( "jpeg", "image/jpeg" );
	Результат.Вставить( "jpg", "image/jpeg" );
	Результат.Вставить( "png", "image/png" );
	Результат.Вставить( "svg", "image/svg" );
	Результат.Вставить( "tiff", "image/tiff" );
	Результат.Вставить( "ico", "image/vnd.microsoft.icon" );
	
	Результат.Вставить( "html", "text/html" );
	Результат.Вставить( "txt", "text/plain" );
	Результат.Вставить( "xml", "text/xml");
	
	Результат.Вставить( "mpeg", "video/mpeg");
	Результат.Вставить( "mpg", "video/mpeg");
	Результат.Вставить( "mp4", "video/mp4");
	Результат.Вставить( "mov", "video/quicktime");
	Результат.Вставить( "wmv", "video/x-ms-wmv");
	Результат.Вставить( "flv", "video/x-flv");
	Результат.Вставить( "3gpp", "video/3gpp");
	Результат.Вставить( "3gp", "video/3gpp");
	Результат.Вставить( "3gpp2", "video/3gpp2");
	Результат.Вставить( "3g2", "video/3gpp2");
	
	Результат.Вставить( "odt", "application/vnd.oasis.opendocument.text");
	Результат.Вставить( "ods", "application/vnd.oasis.opendocument.spreadsheet");
	Результат.Вставить( "odp", "application/vnd.oasis.opendocument.presentation");
	Результат.Вставить( "odg", "application/vnd.oasis.opendocument.graphics");
	
	Результат.Вставить( "doc", "application/msword");
	Результат.Вставить( "docx", "application/vnd.openxmlformats-officedocument.wordprocessingml.document");
	Результат.Вставить( "xls", "application/vnd.ms-excel");
	Результат.Вставить( "xlsx", "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet");
	Результат.Вставить( "ppt", "application/vnd.ms-powerpoint");
	Результат.Вставить( "pptx", "application/vnd.openxmlformats-officedocument.presentationml.presentation");
	
	Результат.Вставить( "rar", "application/x-rar-compressed");
	
	Результат.Вставить( "p7m", "application/x-pkcs7-mime");
	Результат.Вставить( "p7s", "application/x-pkcs7-signature");
	
	// добавим элементы для быстрого поиска по Значению
	Для Каждого РезультатЭлемент Из Результат Цикл
		Результат.Вставить( РезультатЭлемент.Значение, РезультатЭлемент.Ключ );
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти
